---
kind: property
id: P:Autodesk.Revit.UI.ColorSelectionDialog.SelectedColor
source: html/a8eafb21-c963-a98e-659d-b55f4010a5fa.htm
---
# Autodesk.Revit.UI.ColorSelectionDialog.SelectedColor Property

The new color selected by the user.

## Syntax (C#)
```csharp
public Color SelectedColor { get; }
```